docs/posts/2023-07-20-make-an-org-publish-index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-11-06 Wed 10:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Tagging Posts with the Ox-Publish =:makeindex= Function</title>
<meta name="author" content="Britt Anderson" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="preamble" class="status">
<nav>
&emsp; <a href="/index.html">Home</a>
&emsp; <a href="/about.html">About</a>
&emsp; <a href="/pubs.html">Publications</a>
&emsp; <a href="/posts.html">Posts</a>
&emsp; <a href="/posts/theindex.html">Posts by Topics</a>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">Tagging Posts with the Ox-Publish <code>:makeindex</code> Function</h1>
<p>
I have been wanting to have a way to <i>tag</i> different blog posts with different topics. This is a personal blog so the topics can ramble from fun one offs, to technical thoughts, to code snippets I want to remember. I did not see an easy way to do this until I stumbled across the <code>:makeindex</code> option for orgmode.
</p>

<p>
Essentiall you use the <code>#+Index: some-topic-here</code> keyword and then when you publish your org-project, assuming you set the <code>:makeindex</code> to non-nil you will get an <code>theindex.org</code> file that inputs <code>theindex.inc</code>. If you do that you will see a decent index, but the way the links are created you will see the same keyword multiple times with no individuation. I found that the function to make the index lives in <code>ox-publish.el</code> and I fiddled with the formatting in the <code>org-publish-index-generate-theindex</code> function. The following snippet contains more for context, but all I changed was the format line to make the keyword appear in bold and the link to the blog post file follow.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">dotimes</span> (n len)
                (insert
                 (concat
                  (make-string (* (+ rank n) 2) ?\s) <span style="font-style: italic;">"  - "</span>
                  (<span style="font-weight: bold;">if</span> (not (= (1- len) n)) (nth (+ rank n) entry)
                    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Last term: Link it to TARGET, if possible.</span>
                    (<span style="font-weight: bold;">let</span> ((target (nth 2 idx)))
                      (format
                       <span style="font-style: italic;">"*%s* [[%s]]"</span>
                       (car (last entry))
                       <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Destination.</span>
                       (<span style="font-weight: bold;">pcase</span> (car target)
                         (`nil (format <span style="font-style: italic;">"file:%s"</span> file))
                         (`id (format <span style="font-style: italic;">"id:%s"</span> (cdr target)))
                         (`custom-id (format <span style="font-style: italic;">"file:%s::#%s"</span> file (cdr target)))
                         (_ (format <span style="font-style: italic;">"file:%s::*%s"</span> file (cdr target))))
                       <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Description.</span>
                       )))
                  <span style="font-style: italic;">"\n"</span>))))


</pre>
</div>

<p>
I hope this helps someone else (and me when  I next update org and it goes away). Soon I will ask on the mailing list how an option like this might be best incorporated.
</p>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-07-20 Thu 00:00</p>
<p class="author">Author: Britt Anderson</p>
<p class="date">Created: 2024-11-06 Wed 10:32</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
